package com.example.slf.piocompiler.YuFa;

/*错误号
 0  ,"缺少左括号"
 1   ,"非法字符：赋值符号:="
 2  ,"等号后的字符为非法字符"
 3   ,"缺少等号"
 4   ,"声明过程中遇到的字符不是标识符"
 5   ,"缺少分号"
 6   ,"非法语句"
 7   ,"整数大小越界"
 8   ,"整数位数越界"
 9   ,"缺少右括号"
 10   ,"语句和语句之间没有分号"
 11  ,"标识符不存在"
 12  ,"标识符不是变量名"
 13   ,"缺少赋值符号"
 14   ,"call后不是标识符"
 15   ,"call后不是过程名"
 16   ,"if后不是then"
 17   ,"没有遇到end"
 18   ,"while循环缺少do"
 19   ,"标识符长度越界"
 20   ,"缺少逻辑运算符"
 21   ,"标识符为过程名"
 22   ,"缺少右括号"

 */
public class MyError {
	public static String errInfo="";
	String[] err = { " 缺少左括号", "非法字符：赋值符号:=", "等号后的字符为非法字符", "缺少等号",
			"声明过程中遇到的字符不是标识符", "缺少分号", "非法语句", "整数大小越界", "整数位数越界", "缺少右括号",
			"语句和语句之间没有分号", "标识符不存在", "标识符不是变量名", "缺少赋值符号", "call后不是标识符",
			"call后不是过程名", "if后不是then", "没有遇到end", "while循环缺少do", "标识符长度越界",
			"缺少逻辑运算符", "标识符为过程名", "缺少右括号" };

	public void error(int linenumber, int t) {
		System.out.println("行: " + linenumber + "\t错误号: " + t + "  " + err[t]);
		errInfo=errInfo+"第" + linenumber+"行: " +"  " + err[t] +"\n";
	}
}
